//////////////////////////////////////////////////////////////
import fontsize;
import "../../asy/node/node/node.asy" as node;

settings.tex = "xelatex";
texpreamble("\usepackage{xeCJK}");
texpreamble("\setCJKmainfont[Path=../surangama/fonts/]{stsong-lyj.ttf}");

//////////////////////////////////////////////////////////////

node book = node("《红楼梦》梗概", "d");

node[] chapters;

//////////////////////////////////////////////////////////////
// 001
node N001 = node("第一回: 甄士隐梦幻识通灵，贾雨村风尘怀闺秀", "d"); 
node N001_1 = node("甄士隐夏日闲坐", "f");
    node N001_11 = node("梦游太虚幻境", "f");
        node N001_111 = node("遇茫茫大士、渺渺真人", "f");
        node N001_112 = node("闻绛珠草、神瑛侍者等事", "f");
    node N001_12 = node("遇一僧一道哭英莲", "f");
node N001_2 = node("贾雨村寄居葫芦庙", "f");
    node N001_21 = node("娇杏回头", "f");
    node N001_22 = node("中秋畅饮寓怀获赠银", "f");
node N001_3 = node("祸起元宵节 ", "f");
node N001_31 = node("霍启小解失英莲", "f");
node N001_32 = node("三月十五葫芦庙失火", "f");
node N001_33 = node("甄士隐家败投岳丈", "f");
    node N001_331 = node("闻好了歌出家", "f");
node N001_4 = node("贾雨村赴任如州知府", "f");
    node N001_41 = node("传封肃", "f");
    node N001_42 = node("收娇杏", "f");

N001.attach(N001_1, N001_2, N001_3, N001_4);
    N001_1.attach(N001_11, N001_12);
        N001_11.attach(N001_111, N001_112);
    N001_2.attach(N001_21, N001_22);
    N001_3.attach(N001_31, N001_32, N001_33);
        N001_33.attach(N001_331);
    N001_4.attach(N001_41, N001_42);

chapters.push(N001);

//////////////////////////////////////////////////////////////
// 002
node N002 = node("第二回: 贾夫人仙逝扬州城，冷子兴演说荣国府", "d"); 
node N002_1 = node("贾雨村贪酷遭参革", "f");
    node N002_11 = node("担风袖月游览天下", "f");
    node N002_12 = node("偶感风寒坐馆扬州", "f");
        node N002_121 = node("交代鹾政林如海", "f");
node N002_2 = node("贾敏病终", "f");
    node N002_21 = node("黛玉守制多病", "f");
node N002_3 = node("贾雨村饭后闲步郭外", "f");
    node N002_31 = node("智通寺观联遇老僧", "f");
    node N002_32 = node("村肆邂逅冷子兴", "f");
        node N002_321 = node("闻宁荣两府概况", "f");
        node N002_322 = node("发正邪两赋之论", "f");
        node N002_323 = node("述金陵甄宝玉形状", "f");
    node N002_33 = node("遇同僚张如圭报喜", "f");
        node N002_331 = node("冷子兴献计", "f");

N002.attach(N002_1, N002_2, N002_3);
    N002_1.attach(N002_11, N002_12);
        N002_12.attach(N002_121);
    N002_2.attach(N002_21);
    N002_3.attach(N002_31, N002_32, N002_33);
        N002_32.attach(N002_321, N002_322, N002_323);
        N002_33.attach(N002_331);
    
chapters.push(N002);


//////////////////////////////////////////////////////////////
// 003
node N003 = node("第三回: 贾雨村夤缘复旧职，林黛玉抛父进京都", "d");
node N003_1 = node("贾雨村谋补应天府", "f");
    node N003_11 = node("求林如海修荐书", "f");
    node N003_12 = node("攀附贾政为宗侄", "f");
node N003_2 = node("黛玉进京", "f");
    node N003_21 = node("初会", "f");
       node N003_211 = node("贾母大哭", "f");
       node N003_212 = node("见过邢王纨迎探惜等", "f");
       node N003_213 = node("交代癞头和尚及人参养荣丸", "f");
       node N003_214 = node("凤姐出场", "f");
           node N003_2141 = node("我来迟了先声夺人", "f");
           node N003_2142 = node("恭维贾母不露痕迹", "f");
           node N003_2143 = node("悲喜转换堪比影帝", "f");
           node N003_2144 = node("嘘寒问暖霸气侧漏", "f");
       node N003_215 = node("拜见大舅二舅未果", "f");
           node N003_2151 = node("交代荣府两房反常格局", "f");
           node N003_2152 = node("王夫人叮嘱混世魔王难缠", "f");
    node N003_22 = node("晚饭", "f");
           node N003_221 = node("交代贾府传饭规矩排场", "f");
           node N003_222 = node("饭后以茶漱口再吃茶", "f");
    node N003_23 = node("重逢", "f");
        node N003_231 = node("闻得外面一阵脚步响", "f");
        node N003_232 = node("黛玉见宝玉吃一大惊", "f");
        node N003_233 = node("宝玉看黛玉似曾相识", "f");
        node N003_234 = node("黛玉得字颦颦", "f");
        node N003_235 = node("宝玉痴狂摔玉", "f");
    node N003_24 = node("安歇", "f");
        node N003_241 = node("同处碧纱橱", "f");
        node N003_242 = node("交代雪雁、鹦哥(紫鹃)、袭人等", "f");
        node N003_243 = node("黛玉因摔玉落泪", "f");

N003.attach(N003_1, N003_2);
    N003_1.attach(N003_11, N003_12);
    N003_2.attach(N003_21, N003_22, N003_23, N003_24);
        N003_21.attach(N003_211, N003_212, N003_213, N003_214, N003_215);
            N003_214.attach(N003_2141, N003_2142, N003_2143, N003_2144);
            N003_215.attach(N003_2151, N003_2152);
        N003_22.attach(N003_221, N003_222);
        N003_23.attach(N003_231, N003_232, N003_233, N003_234, N003_235);
        N003_24.attach(N003_241, N003_242, N003_243);
        
chapters.push(N003);

//////////////////////////////////////////////////////////////
// 004
node N004 = node("第四回: 薄命女偏逢薄命郎，葫芦僧乱判葫芦案", "d");
node N004_1 = node("交代李纨", "f");
node N004_2 = node("贾雨村判案", "f");
    node N004_21 = node("冯渊丧命", "f");
    node N004_22 = node("门子攀旧", "f");
        node N004_221 = node("呈护官符详解贾史王薛", "f");
        node N004_222 = node("献扶乩计细说来龙去脉", "f");
            node N004_2221 = node("被卖的丫头即被拐的英莲", "f");
            node N004_2222 = node("呆霸王薛蟠为贾政的内甥", "f");
    node N004_23 = node("徇情枉法忘恩负义", "f");
    node N004_24 = node("发配门子卸磨杀驴", "f");
node N004_3 = node("薛蟠进京", "f");
    node N004_31 = node("交代宝钗薛姨妈", "f");
    node N004_32 = node("王子腾升任出京", "f");
    node N004_33 = node("入住荣府梨香院", "f");
        node N004_331 = node("与贾府纨绔沆瀣一气乐不思蜀", "f");

N004.attach(N004_1, N004_2, N004_3);
    N004_2.attach(N004_21, N004_22, N004_23, N004_24);
        N004_22.attach(N004_221, N004_222);
            N004_222.attach(N004_2221, N004_2222);
    N004_3.attach(N004_31, N004_32, N004_33);
        N004_33.attach(N004_331);

chapters.push(N004);

//////////////////////////////////////////////////////////////
// 005
node N005 = node("第五回: 游幻境指迷十二钗，饮仙醪曲演红楼梦", "d");
node N005_1 = node("宁府赏梅", "f");
    node N005_11 = node("宝玉午睡", "f");
        node N005_111 = node("铺陈秦氏卧房", "f");
            node N005_1111 = node("伏秦钟", "f");
        node N005_112 = node("梦游太虚幻境", "f");
            node N005_1121 = node("随秦氏遇警幻仙姑", "f");
            node N005_1122 = node("阅薄命司金陵十二衩正副册", "f");
            node N005_1123 = node("闻群芳髓之香", "f");
            node N005_1124 = node("品千红一窟茶", "f");
            node N005_1125 = node("饮万艳同杯酒", "f");
            node N005_1126 = node("听红楼梦十二曲", "f");
            node N005_1127 = node("尝仙闺云雨幻境", "f");
            node N005_1128 = node("遇迷津夜叉海鬼", "f");
        node N005_113 = node("可卿救我梦醒", "f");
node N005_2 = node("宝玉袭人初试云雨", "f");
N005.attach(N005_1, N005_2);
    N005_1.attach(N005_11);
        N005_11.attach(N005_111, N005_112, N005_113);
            N005_111.attach(N005_1111);
            N005_112.attach(N005_1121, N005_1122, N005_1123, N005_1124, N005_1125, N005_1126, N005_1127, N005_1128);

chapters.push(N005);

//////////////////////////////////////////////////////////////
// 006
node N006 = node("第六回: 贾宝玉初试云雨情，刘姥姥一进荣国府", "d");
node N006_1 = node("交代狗儿一家", "f");
node N006_2 = node("刘姥姥进荣国府", "f");
    node N006_21 = node("见周瑞家的", "f");
    node N006_22 = node("见凤姐", "f");
        node N006_221 = node("见平儿", "f");
        node N006_222 = node("见自鸣钟", "f");
        node N006_223 = node("默候凤姐用早饭", "f");
        node N006_224 = node("怎么还不请进来？", "f");
        node N006_225 = node("周瑞家的回王夫人", "f");
        node N006_226 = node("贾蓉借玻璃炕屏", "f");
        node N006_227 = node("刘姥姥和板儿吃早饭", "f");
        node N006_228 = node("凤姐赏银二十两并一串车钱", "f");
N006.attach(N006_1, N006_2);
    N006_2.attach(N006_21, N006_22);
        N006_22.attach(N006_221,N006_222,N006_223,N006_224,N006_225,N006_226,N006_227,N006_228);
        
chapters.push(N006);

//////////////////////////////////////////////////////////////
// 007
node N007 = node("第七回: 送宫花贾琏戏熙凤，宴宁府宝玉会秦钟", "d");
node N007_1 = node("周瑞家的回王夫人", "f");
    node N007_11 = node("和宝钗聊天", "f");
        node N007_111 = node("冷香丸海上方", "f");
node N007_2 = node("周瑞家的送宫花", "f");
    node N007_21 = node("问香菱叹身世", "f");
    node N007_22 = node("找迎春探春", "f");
        node N007_221 = node("交代李纨陪伴照管三春的责任", "f");
    node N007_23 = node("找惜春", "f");
        node N007_231 = node("交代水月庵智能儿净虚等", "f");
    node N007_24 = node("找凤姐", "f");
        node N007_241 = node("巧姐午睡", "f");
        node N007_242 = node("贾琏凤姐日中行房", "f");
        node N007_243 = node("吩咐彩明送花给秦氏", "f");
    node N007_25 = node("碰到自己女儿", "f");
        node N007_251 = node("冷子兴的官司", "f");
    node N007_26 = node("找黛玉", "f");
        node N007_261 = node("宝玉吩咐茜雪看望宝钗", "f");
node N007_3 = node("凤姐晚间回王夫人", "f");
    node N007_31 = node("甄家送来东西", "f");
    node N007_32 = node("尤氏单独邀请凤姐明日逛宁府", "f");
node N007_4 = node("凤姐带宝玉逛宁府", "f");
    node N007_41 = node("宝玉会秦钟", "f");
        node N007_411 = node("凤姐给秦钟见面礼", "f");
        node N007_412 = node("二人商定共入义塾读书", "f");
    node N007_42 = node("尤氏凤姐秦氏抹牌", "f");
        node N007_421 = node("尤氏婆媳输了后日的戏酒东道", "f");
    node N007_43 = node("焦大醉酒骂府", "f");
        node N007_431 = node("骂赖二欺软怕硬", "f");
        node N007_432 = node("骂贾蓉忘恩负义", "f");
        node N007_433 = node("骂宁府上下都不干净", "f");

N007.attach(N007_1, N007_2, N007_3, N007_4);
N007_1.attach(N007_11);
    N007_11.attach(N007_111);
N007_2.attach(N007_21, N007_22, N007_23, N007_24, N007_25, N007_26);
    N007_22.attach(N007_221);
    N007_23.attach(N007_231);
    N007_24.attach(N007_241, N007_242, N007_243);
    N007_25.attach(N007_251);
    N007_26.attach(N007_261);
N007_3.attach(N007_31, N007_32);
N007_4.attach(N007_41, N007_42, N007_43);
    N007_41.attach(N007_411, N007_412);
    N007_42.attach(N007_421);
    N007_43.attach(N007_431, N007_432, N007_433);

chapters.push(N007);

//////////////////////////////////////////////////////////////
// 008
node N008 = node("第八回: 比通灵金莺微露意，探宝钗黛玉半含酸", "d");
//chapters.push(N008);

//////////////////////////////////////////////////////////////
// 009
node N009 = node("第九回: 恋风流情友入家塾，起嫌疑顽童闹学堂", "d");
//chapters.push(N009);

//////////////////////////////////////////////////////////////
// 010
node N010 = node("第十回: 金寡妇贪利权受辱，张太医论病细穷源", "d");
//chapters.push(N010);

//////////////////////////////////////////////////////////////
// 011
node N011 = node("第十一回: 庆寿辰宁府排家宴，见熙凤贾瑞起淫心", "d");
//chapters.push(N011);

//////////////////////////////////////////////////////////////
// 012
node N012 = node("第十二回: 王熙凤毒设相思局，贾天祥正照风月鉴", "d");
//chapters.push(N012);

//////////////////////////////////////////////////////////////
// 013
node N013 = node("第十三回: 秦可卿死封龙禁尉，王熙凤协理宁国府", "d");
//chapters.push(N013);

//////////////////////////////////////////////////////////////
// 014
node N014 = node("第十四回: 林如海捐馆扬州城，贾宝玉路谒北静王", "d");
//chapters.push(N014);

//////////////////////////////////////////////////////////////
// 015
node N015 = node("第十五回: 王凤姐弄权铁槛寺，秦鲸卿得趣馒头庵", "d");
//chapters.push(N015);

//////////////////////////////////////////////////////////////
// 016
node N016 = node("第十六回: 贾元春才选凤藻宫，秦鲸卿夭逝黄泉路", "d");
//chapters.push(N016);

//////////////////////////////////////////////////////////////
// 017
node N017 = node("第十七回: 大观园试才题对额，荣国府归省庆元宵", "d");
//chapters.push(N017);

//////////////////////////////////////////////////////////////
// 018
node N018 = node("第十八回: 隔珠帘父女勉忠勤，搦湘管姊弟裁题咏", "d");
//chapters.push(N018);

//////////////////////////////////////////////////////////////
// 019
node N019 = node("第十九回: 情切切良宵花解语，意绵绵静日玉生香", "d");
//chapters.push(N019);

//////////////////////////////////////////////////////////////
// 020
node N020 = node("第二十回: 王熙凤正言弹妒意，林黛玉俏语谑娇音", "d");
//chapters.push(N020);

//////////////////////////////////////////////////////////////
// 021
node N021 = node("第二十一回: 贤袭人娇嗔箴宝玉，俏平儿软语救贾琏", "d");
//chapters.push(N021);

//////////////////////////////////////////////////////////////
// 022
node N022 = node("第二十二回: 听曲文宝玉悟禅机，制灯迷贾政悲谶语", "d");
//chapters.push(N022);

//////////////////////////////////////////////////////////////
// 023
node N023 = node("第二十三回: 西厢记妙词通戏语，牡丹亭艳曲警芳心", "d");
//chapters.push(N023);

//////////////////////////////////////////////////////////////
// 024
node N024 = node("第二十四回: 醉金刚轻财尚义侠，痴女儿遗帕惹相思", "d");
//chapters.push(N024);

//////////////////////////////////////////////////////////////
// 025
node N025 = node("第二十五回: 魇魔法姊弟逢五鬼，红楼梦通灵遇双真", "d");
//chapters.push(N025);

//////////////////////////////////////////////////////////////
// 026
node N026 = node("第二十六回: 蜂腰桥设言传心事，潇湘馆春困发幽情", "d");
//chapters.push(N026);

//////////////////////////////////////////////////////////////
// 027
node N027 = node("第二十七回: 滴翠亭杨妃戏彩蝶，埋香冢飞燕泣残红", "d");
//chapters.push(N027);

//////////////////////////////////////////////////////////////
// 028
node N028 = node("第二十八回: 蒋玉菡情赠茜香罗，薛宝钗羞笼红麝串", "d");
//chapters.push(N028);

//////////////////////////////////////////////////////////////
// 029
node N029 = node("第二十九回: 享福人福深还祷福，痴情女情重愈斟情", "d");
//chapters.push(N029);

//////////////////////////////////////////////////////////////
// 030
node N030 = node("第三十回: 宝钗借扇机带双敲，龄官划蔷痴及局外", "d");
//chapters.push(N030);

//////////////////////////////////////////////////////////////
// 031
node N031 = node("第三十一回: 撕扇子作千金一笑，因麒麟伏白首双星", "d");
//chapters.push(N031);

//////////////////////////////////////////////////////////////
// 032
node N032 = node("第三十二回: 诉肺腑心迷活宝玉，含耻辱情烈死金钏", "d");
//chapters.push(N032);

//////////////////////////////////////////////////////////////
// 033
node N033 = node("第三十三回: 手足耽耽小动唇舌，不肖种种大承笞挞", "d");
//chapters.push(N033);

//////////////////////////////////////////////////////////////
// 034
node N034 = node("第三十四回: 情中情因情感妹妹，错里错以错劝哥哥", "d");
//chapters.push(N034);

//////////////////////////////////////////////////////////////
// 035
node N035 = node("第三十五回: 白玉钏亲尝莲叶羹，黄金莺巧结梅花络", "d");
//chapters.push(N035);

//////////////////////////////////////////////////////////////
// 036
node N036 = node("第三十六回: 绣鸳鸯梦兆绛芸轩，识分定情悟梨香院", "d");
//chapters.push(N036);

//////////////////////////////////////////////////////////////
// 037
node N037 = node("第三十七回: 秋爽斋偶结海棠社，蘅芜苑夜拟菊花题", "d");
//chapters.push(N037);

//////////////////////////////////////////////////////////////
// 038
node N038 = node("第三十八回: 林潇湘魁夺菊花诗，薛蘅芜讽和螃蟹咏", "d");
//chapters.push(N038);

//////////////////////////////////////////////////////////////
// 039
node N039 = node("第三十九回: 村姥姥是信口开合，情哥哥偏寻根究底", "d");
//chapters.push(N039);

//////////////////////////////////////////////////////////////
// 040
node N040 = node("第四十回: 史太君两宴大观园，金鸳鸯三宣牙牌令", "d");
//chapters.push(N040);

//////////////////////////////////////////////////////////////
// 041
node N041 = node("第四十一回: 栊翠庵茶品梅花雪，怡红院劫遇母蝗虫", "d");
//chapters.push(N041);

//////////////////////////////////////////////////////////////
// 042
node N042 = node("第四十二回: 蘅芜君兰言解疑癖，潇湘子雅谑补余香", "d");
//chapters.push(N042);

//////////////////////////////////////////////////////////////
// 043
node N043 = node("第四十三回: 闲取乐偶攒金庆寿，不了情暂撮土为香", "d");
//chapters.push(N043);

//////////////////////////////////////////////////////////////
// 044
node N044 = node("第四十四回: 变生不测凤姐泼醋，喜出望外平儿理妆", "d");
//chapters.push(N044);

//////////////////////////////////////////////////////////////
// 045
node N045 = node("第四十五回: 金兰契互剖金兰语，风雨夕闷制风雨词", "d");
//chapters.push(N045);

//////////////////////////////////////////////////////////////
// 046
node N046 = node("第四十六回: 尴尬人难免尴尬事，鸳鸯女誓绝鸳鸯偶", "d");
//chapters.push(N046);

//////////////////////////////////////////////////////////////
// 047
node N047 = node("第四十七回: 呆霸王调情遭苦打，冷郎君惧祸走他乡", "d");
//chapters.push(N047);

//////////////////////////////////////////////////////////////
// 048
node N048 = node("第四十八回: 滥情人情误思游艺，慕雅女雅集苦吟诗", "d");
//chapters.push(N048);

//////////////////////////////////////////////////////////////
// 049
node N049 = node("第四十九回: 琉璃世界白雪红梅，脂粉香娃割腥啖膻", "d");
//chapters.push(N049);

//////////////////////////////////////////////////////////////
// 050
node N050 = node("第五十回: 芦雪庵争联即景诗，暖香坞雅制春灯谜", "d");
//chapters.push(N050);

//////////////////////////////////////////////////////////////
// 051
node N051 = node("第五十一回: 薛小妹新编怀古诗，胡庸医乱用虎狼药", "d");
//chapters.push(N051);

//////////////////////////////////////////////////////////////
// 052
node N052 = node("第五十二回: 俏平儿情掩虾须镯，勇晴雯病补雀金裘", "d");
//chapters.push(N052);

//////////////////////////////////////////////////////////////
// 053
node N053 = node("第五十三回: 宁国府除夕祭宗祠，荣国府元宵开夜宴", "d");
//chapters.push(N053);

//////////////////////////////////////////////////////////////
// 054
node N054 = node("第五十四回: 史太君破陈腐旧套，王熙凤效戏彩斑衣", "d");
//chapters.push(N054);

//////////////////////////////////////////////////////////////
// 055
node N055 = node("第五十五回: 辱亲女愚妾争闲气，欺幼主刁奴蓄险心", "d");
//chapters.push(N055);

//////////////////////////////////////////////////////////////
// 056
node N056 = node("第五十六回: 敏探春兴利除宿弊，时宝钗小惠全大体", "d");
//chapters.push(N056);

//////////////////////////////////////////////////////////////
// 057
node N057 = node("第五十七回: 慧紫鹃情辞试忙玉，慈姨妈爱语慰痴颦", "d");
//chapters.push(N057);

//////////////////////////////////////////////////////////////
// 058
node N058 = node("第五十八回: 杏子阴假凤泣虚凰，茜纱窗真情揆痴理", "d");
//chapters.push(N058);

//////////////////////////////////////////////////////////////
// 059
node N059 = node("第五十九回: 柳叶渚边嗔莺咤燕，绛云轩里召将飞符", "d");
//chapters.push(N059);

//////////////////////////////////////////////////////////////
// 060
node N060 = node("第六十回: 茉莉粉替去蔷薇硝，玫瑰露引来茯苓霜", "d");
//chapters.push(N060);

//////////////////////////////////////////////////////////////
// 061
node N061 = node("第六十一回: 投鼠忌器宝玉瞒赃，判冤决狱平儿行权", "d");
//chapters.push(N061);

//////////////////////////////////////////////////////////////
// 062
node N062 = node("第六十二回: 憨湘云醉眠芍药茵，呆香菱情解石榴裙", "d");
//chapters.push(N062);

//////////////////////////////////////////////////////////////
// 063
node N063 = node("第六十三回: 寿怡红群芳开夜宴，死金丹独艳理亲丧", "d");
//chapters.push(N063);

//////////////////////////////////////////////////////////////
// 064
node N064 = node("第六十四回: 幽淑女悲题五美吟，浪荡子情遗九龙佩", "d");
//chapters.push(N064);

//////////////////////////////////////////////////////////////
// 065
node N065 = node("第六十五回: 贾二舍偷娶尤二姨，尤三姐思嫁柳二郎", "d");
//chapters.push(N065);

//////////////////////////////////////////////////////////////
// 066
node N066 = node("第六十六回: 情小妹耻情归地府，冷二郎一冷入空门", "d");
//chapters.push(N066);

//////////////////////////////////////////////////////////////
// 067
node N067 = node("第六十七回: 见土仪颦卿思故里，闻秘事凤姐讯家童", "d");
//chapters.push(N067);

//////////////////////////////////////////////////////////////
// 068
node N068 = node("第六十八回: 苦尤娘赚入大观园，酸凤姐大闹宁国府", "d");
//chapters.push(N068);

//////////////////////////////////////////////////////////////
// 069
node N069 = node("第六十九回: 弄小巧用借剑杀人，觉大限吞生金自逝", "d");
//chapters.push(N069);

//////////////////////////////////////////////////////////////
// 070
node N070 = node("第七十回: 林黛玉重建桃花社，史湘云偶填柳絮词", "d");
//chapters.push(N070);

//////////////////////////////////////////////////////////////
// 071
node N071 = node("第七十一回: 嫌隙人有心生嫌隙，鸳鸯女无意遇鸳鸯", "d");
//chapters.push(N071);

//////////////////////////////////////////////////////////////
// 072
node N072 = node("第七十二回: 王熙凤恃强羞说病，来旺妇倚势霸成亲", "d");
//chapters.push(N072);

//////////////////////////////////////////////////////////////
// 073
node N073 = node("第七十三回: 痴丫头误拾绣春囊，懦小姐不问累金凤", "d");
//chapters.push(N073);

//////////////////////////////////////////////////////////////
// 074
node N074 = node("第七十四回: 惑奸谗抄检大观园，矢孤介杜绝宁国府", "d");
//chapters.push(N074);

//////////////////////////////////////////////////////////////
// 075
node N075 = node("第七十五回: 开夜宴异兆发悲音，赏中秋新词得佳谶", "d");
//chapters.push(N075);

//////////////////////////////////////////////////////////////
// 076
node N076 = node("第七十六回: 凸碧堂品笛感凄清，凹晶馆联诗悲寂寞", "d");
//chapters.push(N076);

//////////////////////////////////////////////////////////////
// 077
node N077 = node("第七十七回: 俏丫鬟抱屈夭风流，美优伶斩情归水月", "d");
//chapters.push(N077);

//////////////////////////////////////////////////////////////
// 078
node N078 = node("第七十八回: 老学士闲征诡画词，痴公子杜撰芙蓉诔", "d");
//chapters.push(N078);

//////////////////////////////////////////////////////////////
// 079
node N079 = node("第七十九回: 薛文龙悔娶河东狮，贾迎春误嫁中山狼", "d");
//chapters.push(N079);

//////////////////////////////////////////////////////////////
// 080
node N080 = node("第八十回: 美香菱屈受贪夫棒，王道士胡诌妒妇方", "d");
//chapters.push(N080);


//###################################################################################
//###################################################################################

//////////////////////////////////////////////////////////////
// book
for (int i = 0; i < chapters.length; ++ i) {
    book.attach(chapters[i]);
}



//////////////////////////////////////////////////////////////
// 画图
for (int i = 0; i < chapters.length; ++ i) {
    erase(currentpicture);
    picture pic = draw_tree(chapters[i], style=TREE_STYLE_STEP, gene_gap=40);
    //picture pic = draw_dir_tree(chapters[i]);
    attach(bbox(pic, 5, 5, white), (0,0), SE);
    shipout(format("hlm_%03d", (i + 1)));
}

/*

erase(currentpicture);
picture pic = draw_tree(book, style=TREE_STYLE_STEP, gene_gap=45);

attach(bbox(pic, 5, 5, white), (0,0), SE);
shipout("hlm");
*/
