//////////////////////////////////////////////////////////////
import fontsize;
import "../../asy/node/node/node.asy" as node;

settings.tex = "xelatex";
texpreamble("\usepackage{xeCJK}");
texpreamble("\setCJKmainfont[Path=../surangama/fonts/]{stsong-lyj.ttf}");

//////////////////////////////////////////////////////////////

node book = node("《红楼梦》梗概", "d");

node[] chapters;

//////////////////////////////////////////////////////////////
// 001
node N001 = node("第一回: 甄士隐梦幻识通灵，贾雨村风尘怀闺秀", "d"); 
node N001_1 = node("甄士隐夏日闲坐", "f");
    node N001_11 = node("梦游太虚幻境", "f");
        node N001_111 = node("遇茫茫大士、渺渺真人", "f");
        node N001_112 = node("闻绛珠草、神瑛侍者等事", "f");
    node N001_12 = node("一僧一道哭英莲", "f");
node N001_2 = node("贾雨村出场", "f");
    node N001_21 = node("娇杏回头", "f");
    node N001_22 = node("中秋宴饮寓怀获赠银", "f");
node N001_3 = node("元宵霍启失英莲", "f");
node N001_4 = node("三月十五葫芦庙失火", "f");
node N001_5 = node("甄士隐投岳丈", "f");
    node N001_51 = node("闻好了歌出家", "f");
node N001_6 = node("贾雨村初上任", "f");
    node N001_61 = node("传封肃", "f");
    node N001_62 = node("收娇杏", "f");

N001.attach(N001_1, N001_2, N001_3, N001_4, N001_5, N001_6);
    N001_1.attach(N001_11, N001_12);
        N001_11.attach(N001_111, N001_112);
    N001_2.attach(N001_21, N001_22);
    N001_5.attach(N001_51);
    N001_6.attach(N001_61, N001_62);

chapters.push(N001);

//////////////////////////////////////////////////////////////
// 002
node N002 = node("第二回: 贾夫人仙逝扬州城，冷子兴演说荣国府", "d"); 
node N002_1 = node("贾雨村被弹劾", "f");
N002.attach(N002_1);

chapters.push(N002);


//////////////////////////////////////////////////////////////
// 003
node N003 = node("第三回: 贾雨村夤缘复旧职，林黛玉抛父进京都", "d");
chapters.push(N003);

//////////////////////////////////////////////////////////////
// 004
node N004 = node("第四回: 薄命女偏逢薄命郎，葫芦僧乱判葫芦案", "d");
chapters.push(N004);

//////////////////////////////////////////////////////////////
// 005
node N005 = node("第五回: 游幻境指迷十二钗，饮仙醪曲演红楼梦", "d");
chapters.push(N005);

//////////////////////////////////////////////////////////////
// 006
node N006 = node("第六回: 贾宝玉初试云雨情，刘姥姥一进荣国府", "d");
chapters.push(N006);

//////////////////////////////////////////////////////////////
// 007
node N007 = node("第七回: 送宫花贾琏戏熙凤，宴宁府宝玉会秦钟", "d");
chapters.push(N007);

//////////////////////////////////////////////////////////////
// 008
node N008 = node("第八回: 比通灵金莺微露意，探宝钗黛玉半含酸", "d");
chapters.push(N008);

//////////////////////////////////////////////////////////////
// 009
node N009 = node("第九回: 恋风流情友入家塾，起嫌疑顽童闹学堂", "d");
chapters.push(N009);

//////////////////////////////////////////////////////////////
// 010
node N010 = node("第十回: 金寡妇贪利权受辱，张太医论病细穷源", "d");
chapters.push(N010);

//////////////////////////////////////////////////////////////
// 011
node N011 = node("第十一回: 庆寿辰宁府排家宴，见熙凤贾瑞起淫心", "d");
chapters.push(N011);

//////////////////////////////////////////////////////////////
// 012
node N012 = node("第十二回: 王熙凤毒设相思局，贾天祥正照风月鉴", "d");
chapters.push(N012);

//////////////////////////////////////////////////////////////
// 013
node N013 = node("第十三回: 秦可卿死封龙禁尉，王熙凤协理宁国府", "d");
chapters.push(N013);

//////////////////////////////////////////////////////////////
// 014
node N014 = node("第十四回: 林如海捐馆扬州城，贾宝玉路谒北静王", "d");
chapters.push(N014);

//////////////////////////////////////////////////////////////
// 015
node N015 = node("第十五回: 王凤姐弄权铁槛寺，秦鲸卿得趣馒头庵", "d");
chapters.push(N015);

//////////////////////////////////////////////////////////////
// 016
node N016 = node("第十六回: 贾元春才选凤藻宫，秦鲸卿夭逝黄泉路", "d");
chapters.push(N016);

//////////////////////////////////////////////////////////////
// 017
node N017 = node("第十七回: 大观园试才题对额，荣国府归省庆元宵", "d");
chapters.push(N017);

//////////////////////////////////////////////////////////////
// 018
node N018 = node("第十八回: 隔珠帘父女勉忠勤，搦湘管姊弟裁题咏", "d");
chapters.push(N018);

//////////////////////////////////////////////////////////////
// 019
node N019 = node("第十九回: 情切切良宵花解语，意绵绵静日玉生香", "d");
chapters.push(N019);

//////////////////////////////////////////////////////////////
// 020
node N020 = node("第二十回: 王熙凤正言弹妒意，林黛玉俏语谑娇音", "d");
chapters.push(N020);

//////////////////////////////////////////////////////////////
// 021
node N021 = node("第二十一回: 贤袭人娇嗔箴宝玉，俏平儿软语救贾琏", "d");
chapters.push(N021);

//////////////////////////////////////////////////////////////
// 022
node N022 = node("第二十二回: 听曲文宝玉悟禅机，制灯迷贾政悲谶语", "d");
chapters.push(N022);

//////////////////////////////////////////////////////////////
// 023
node N023 = node("第二十三回: 西厢记妙词通戏语，牡丹亭艳曲警芳心", "d");
chapters.push(N023);

//////////////////////////////////////////////////////////////
// 024
node N024 = node("第二十四回: 醉金刚轻财尚义侠，痴女儿遗帕惹相思", "d");
chapters.push(N024);

//////////////////////////////////////////////////////////////
// 025
node N025 = node("第二十五回: 魇魔法姊弟逢五鬼，红楼梦通灵遇双真", "d");
chapters.push(N025);

//////////////////////////////////////////////////////////////
// 026
node N026 = node("第二十六回: 蜂腰桥设言传心事，潇湘馆春困发幽情", "d");
chapters.push(N026);

//////////////////////////////////////////////////////////////
// 027
node N027 = node("第二十七回: 滴翠亭杨妃戏彩蝶，埋香冢飞燕泣残红", "d");
chapters.push(N027);

//////////////////////////////////////////////////////////////
// 028
node N028 = node("第二十八回: 蒋玉菡情赠茜香罗，薛宝钗羞笼红麝串", "d");
chapters.push(N028);

//////////////////////////////////////////////////////////////
// 029
node N029 = node("第二十九回: 享福人福深还祷福，痴情女情重愈斟情", "d");
chapters.push(N029);

//////////////////////////////////////////////////////////////
// 030
node N030 = node("第三十回: 宝钗借扇机带双敲，龄官划蔷痴及局外", "d");
chapters.push(N030);

//////////////////////////////////////////////////////////////
// 031
node N031 = node("第三十一回: 撕扇子作千金一笑，因麒麟伏白首双星", "d");
chapters.push(N031);

//////////////////////////////////////////////////////////////
// 032
node N032 = node("第三十二回: 诉肺腑心迷活宝玉，含耻辱情烈死金钏", "d");
chapters.push(N032);

//////////////////////////////////////////////////////////////
// 033
node N033 = node("第三十三回: 手足耽耽小动唇舌，不肖种种大承笞挞", "d");
chapters.push(N033);

//////////////////////////////////////////////////////////////
// 034
node N034 = node("第三十四回: 情中情因情感妹妹，错里错以错劝哥哥", "d");
chapters.push(N034);

//////////////////////////////////////////////////////////////
// 035
node N035 = node("第三十五回: 白玉钏亲尝莲叶羹，黄金莺巧结梅花络", "d");
chapters.push(N035);

//////////////////////////////////////////////////////////////
// 036
node N036 = node("第三十六回: 绣鸳鸯梦兆绛芸轩，识分定情悟梨香院", "d");
chapters.push(N036);

//////////////////////////////////////////////////////////////
// 037
node N037 = node("第三十七回: 秋爽斋偶结海棠社，蘅芜苑夜拟菊花题", "d");
chapters.push(N037);

//////////////////////////////////////////////////////////////
// 038
node N038 = node("第三十八回: 林潇湘魁夺菊花诗，薛蘅芜讽和螃蟹咏", "d");
chapters.push(N038);

//////////////////////////////////////////////////////////////
// 039
node N039 = node("第三十九回: 村姥姥是信口开合，情哥哥偏寻根究底", "d");
chapters.push(N039);

//////////////////////////////////////////////////////////////
// 040
node N040 = node("第四十回: 史太君两宴大观园，金鸳鸯三宣牙牌令", "d");
chapters.push(N040);

//////////////////////////////////////////////////////////////
// 041
node N041 = node("第四十一回: 栊翠庵茶品梅花雪，怡红院劫遇母蝗虫", "d");
chapters.push(N041);

//////////////////////////////////////////////////////////////
// 042
node N042 = node("第四十二回: 蘅芜君兰言解疑癖，潇湘子雅谑补余香", "d");
chapters.push(N042);

//////////////////////////////////////////////////////////////
// 043
node N043 = node("第四十三回: 闲取乐偶攒金庆寿，不了情暂撮土为香", "d");
chapters.push(N043);

//////////////////////////////////////////////////////////////
// 044
node N044 = node("第四十四回: 变生不测凤姐泼醋，喜出望外平儿理妆", "d");
chapters.push(N044);

//////////////////////////////////////////////////////////////
// 045
node N045 = node("第四十五回: 金兰契互剖金兰语，风雨夕闷制风雨词", "d");
chapters.push(N045);

//////////////////////////////////////////////////////////////
// 046
node N046 = node("第四十六回: 尴尬人难免尴尬事，鸳鸯女誓绝鸳鸯偶", "d");
chapters.push(N046);

//////////////////////////////////////////////////////////////
// 047
node N047 = node("第四十七回: 呆霸王调情遭苦打，冷郎君惧祸走他乡", "d");
chapters.push(N047);

//////////////////////////////////////////////////////////////
// 048
node N048 = node("第四十八回: 滥情人情误思游艺，慕雅女雅集苦吟诗", "d");
chapters.push(N048);

//////////////////////////////////////////////////////////////
// 049
node N049 = node("第四十九回: 琉璃世界白雪红梅，脂粉香娃割腥啖膻", "d");
chapters.push(N049);

//////////////////////////////////////////////////////////////
// 050
node N050 = node("第五十回: 芦雪庵争联即景诗，暖香坞雅制春灯谜", "d");
chapters.push(N050);

//////////////////////////////////////////////////////////////
// 051
node N051 = node("第五十一回: 薛小妹新编怀古诗，胡庸医乱用虎狼药", "d");
chapters.push(N051);

//////////////////////////////////////////////////////////////
// 052
node N052 = node("第五十二回: 俏平儿情掩虾须镯，勇晴雯病补雀金裘", "d");
chapters.push(N052);

//////////////////////////////////////////////////////////////
// 053
node N053 = node("第五十三回: 宁国府除夕祭宗祠，荣国府元宵开夜宴", "d");
chapters.push(N053);

//////////////////////////////////////////////////////////////
// 054
node N054 = node("第五十四回: 史太君破陈腐旧套，王熙凤效戏彩斑衣", "d");
chapters.push(N054);

//////////////////////////////////////////////////////////////
// 055
node N055 = node("第五十五回: 辱亲女愚妾争闲气，欺幼主刁奴蓄险心", "d");
chapters.push(N055);

//////////////////////////////////////////////////////////////
// 056
node N056 = node("第五十六回: 敏探春兴利除宿弊，时宝钗小惠全大体", "d");
chapters.push(N056);

//////////////////////////////////////////////////////////////
// 057
node N057 = node("第五十七回: 慧紫鹃情辞试忙玉，慈姨妈爱语慰痴颦", "d");
chapters.push(N057);

//////////////////////////////////////////////////////////////
// 058
node N058 = node("第五十八回: 杏子阴假凤泣虚凰，茜纱窗真情揆痴理", "d");
chapters.push(N058);

//////////////////////////////////////////////////////////////
// 059
node N059 = node("第五十九回: 柳叶渚边嗔莺咤燕，绛云轩里召将飞符", "d");
chapters.push(N059);

//////////////////////////////////////////////////////////////
// 060
node N060 = node("第六十回: 茉莉粉替去蔷薇硝，玫瑰露引来茯苓霜", "d");
chapters.push(N060);

//////////////////////////////////////////////////////////////
// 061
node N061 = node("第六十一回: 投鼠忌器宝玉瞒赃，判冤决狱平儿行权", "d");
chapters.push(N061);

//////////////////////////////////////////////////////////////
// 062
node N062 = node("第六十二回: 憨湘云醉眠芍药茵，呆香菱情解石榴裙", "d");
chapters.push(N062);

//////////////////////////////////////////////////////////////
// 063
node N063 = node("第六十三回: 寿怡红群芳开夜宴，死金丹独艳理亲丧", "d");
chapters.push(N063);

//////////////////////////////////////////////////////////////
// 064
node N064 = node("第六十四回: 幽淑女悲题五美吟，浪荡子情遗九龙佩", "d");
chapters.push(N064);

//////////////////////////////////////////////////////////////
// 065
node N065 = node("第六十五回: 贾二舍偷娶尤二姨，尤三姐思嫁柳二郎", "d");
chapters.push(N065);

//////////////////////////////////////////////////////////////
// 066
node N066 = node("第六十六回: 情小妹耻情归地府，冷二郎一冷入空门", "d");
chapters.push(N066);

//////////////////////////////////////////////////////////////
// 067
node N067 = node("第六十七回: 见土仪颦卿思故里，闻秘事凤姐讯家童", "d");
chapters.push(N067);

//////////////////////////////////////////////////////////////
// 068
node N068 = node("第六十八回: 苦尤娘赚入大观园，酸凤姐大闹宁国府", "d");
chapters.push(N068);

//////////////////////////////////////////////////////////////
// 069
node N069 = node("第六十九回: 弄小巧用借剑杀人，觉大限吞生金自逝", "d");
chapters.push(N069);

//////////////////////////////////////////////////////////////
// 070
node N070 = node("第七十回: 林黛玉重建桃花社，史湘云偶填柳絮词", "d");
chapters.push(N070);

//////////////////////////////////////////////////////////////
// 071
node N071 = node("第七十一回: 嫌隙人有心生嫌隙，鸳鸯女无意遇鸳鸯", "d");
chapters.push(N071);

//////////////////////////////////////////////////////////////
// 072
node N072 = node("第七十二回: 王熙凤恃强羞说病，来旺妇倚势霸成亲", "d");
chapters.push(N072);

//////////////////////////////////////////////////////////////
// 073
node N073 = node("第七十三回: 痴丫头误拾绣春囊，懦小姐不问累金凤", "d");
chapters.push(N073);

//////////////////////////////////////////////////////////////
// 074
node N074 = node("第七十四回: 惑奸谗抄检大观园，矢孤介杜绝宁国府", "d");
chapters.push(N074);

//////////////////////////////////////////////////////////////
// 075
node N075 = node("第七十五回: 开夜宴异兆发悲音，赏中秋新词得佳谶", "d");
chapters.push(N075);

//////////////////////////////////////////////////////////////
// 076
node N076 = node("第七十六回: 凸碧堂品笛感凄清，凹晶馆联诗悲寂寞", "d");
chapters.push(N076);

//////////////////////////////////////////////////////////////
// 077
node N077 = node("第七十七回: 俏丫鬟抱屈夭风流，美优伶斩情归水月", "d");
chapters.push(N077);

//////////////////////////////////////////////////////////////
// 078
node N078 = node("第七十八回: 老学士闲征诡画词，痴公子杜撰芙蓉诔", "d");
chapters.push(N078);

//////////////////////////////////////////////////////////////
// 079
node N079 = node("第七十九回: 薛文龙悔娶河东狮，贾迎春误嫁中山狼", "d");
chapters.push(N079);

//////////////////////////////////////////////////////////////
// 080
node N080 = node("第八十回: 美香菱屈受贪夫棒，王道士胡诌妒妇方", "d");
chapters.push(N080);


//###################################################################################
//###################################################################################

//////////////////////////////////////////////////////////////
// book
for (int i = 0; i < chapters.length; ++ i) {
    book.attach(chapters[i]);
}



//////////////////////////////////////////////////////////////
// 画图
for (int i = 0; i < 2; ++ i) {
    erase(currentpicture);
    //picture pic = draw_tree(chapters[i], style=TREE_STYLE_STEP, gene_gap=45);
    picture pic = draw_dir_tree(chapters[i]);
    attach(bbox(pic, 5, 5, white), (0,0), SE);
    shipout(format("hlm_%03d", (i + 1)));
}



erase(currentpicture);
picture pic = draw_tree(book, style=TREE_STYLE_STEP, gene_gap=45);

attach(bbox(pic, 5, 5, white), (0,0), SE);
shipout("hlm");
